sorosaulong-ux/gd32-test-project/Library/gd32a7xx_stcm.c
    if(end == STCM_END_FINISH)
    {
        if(result == STCM_RESULE_SUCCESSFUL)
        {
            lbist_state = STCM_SUCCESSFUL;
        }
        else if(result == STCM_RESULT_FAILED)
        {
            lbist_state = STCM_FAILED;
        }
        else
        {
            lbist_state = STCM_RESULTERROR;
        }
    }
    else if(end == STCM_END_NOTCOMPLETE)
    {
        lbist_state = STCM_NOTCOMPLETE;
    }
    else
    {
        lbist_state = STCM_ENDERROR;
    }
    return lbist_state;
}

/*!
    \brief      LBIST shift clock config (API_ID(0x00016U))
    \param[in]  stepsize: Peripheral shift clock control step size
      \arg        1~8: Peripheral shift clock control step size
    \param[in]  starten: Peripheral shift clock control start enable
      \arg        ENABLE: Peripheral shift clock control start enabled 
      \arg        DISABLE: Peripheral shift clock control start disabled
    \param[in]  enden: Peripheral shift clock control end enable
      \arg        ENABLE: Peripheral shift clock control end enabled 
      \arg        DISABLE: Peripheral shift clock control end disabled
    \param[out] none
    \retval     none
*/
void stcm_lbist_shiftclk_config(uint32_t stepsize, uint32_t starten, uint32_t enden)
{
#ifdef FW_DEBUG_ERR_REPORT
    if( NOT_LBIST_SHIFTCLK_STEP_SIZE(stepsize) || NOT_LBIST_SHIFTCLK_START_EN(starten) || NOT_LBIST_SHIFTCLK_END_EN(enden)){
        fw_debug_report_err(STCM_MODULE_ID,API_ID(0x0016U),ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        STCM_LBPSCC = (stepsize-1U)<<4U;
        if(starten != (uint32_t)DISABLE)
        {
            STCM_LBPSCC |= STCM_LBPSCC_PSCC_SEN;
        }
        if(enden != (uint32_t)DISABLE)
        {
            STCM_LBPSCC |= STCM_LBPSCC_PSCC_EEN;
        }
    }
}

/*!
    \brief      LBIST engine timeout strap config (API_ID(0x00017U))
    \param[in]  timestrap: engine timeout strap raw data, the actual value is 2^timestrap AIT engine reference clock cycles
    \param[out] none
    \retval     none
*/
void stcm_lbist_engine_timestrap_config (uint32_t timestrap)
{
#ifdef FW_DEBUG_ERR_REPORT
    if((timestrap > STCM_LBIST_ENG_TIMESTRAP_MAX)){
        fw_debug_report_err(STCM_MODULE_ID,API_ID(0x0017U),ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        STCM_LBCNTSTRAP = timestrap;
    }
}

/*!
    \brief      LBIST packet config (API_ID(0x00018U))
    \param[in]  first_ait_packet_index: first AIT packet index
    \param[in]  ait_packet_num:  AIT packet number to be executed
    \param[out] none
    \retval     none
*/
void stcm_lbist_packet_config(uint8_t first_ait_packet_index, uint8_t ait_packet_num)
{
#ifdef FW_DEBUG_ERR_REPORT
    if((first_ait_packet_index >= STCM_LBIST_AIT_PACKET_NUM_MAX) || (ait_packet_num > STCM_LBIST_AIT_PACKET_NUM_MAX) ){
        fw_debug_report_err(STCM_MODULE_ID,API_ID(0x0018U),ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        STCM_CFG1 &= ~(STCM_CFG1_LBAITPN | STCM_CFG1_LBAITPADDR);
        STCM_CFG1 |= AIT_PACKET_ADDR(first_ait_packet_index) | ait_packet_num;
    }
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      BIST start (API_ID(0x00019U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void stcm_bist_start(void)
{
    STCM_BRCS = STCM_BRCS_RUNBP;
}

/*!
    \brief      get TMR state (API_ID(0x0001AU))
    \param[in]  none
    \param[out] none
    \retval     TMR state
      \arg       STCM_TMR_ERR: TMR(Triple-Modular Redundancy) run BIST phase error state 
      \arg       STCM_TMR_NORMAL: TMR(Triple-Modular Redundancy) run BIST phase normal state
*/
stcm_tmr_state stcm_tmr_stat_get(void)
{
    stcm_tmr_state tmr_state = STCM_TMR_NORMAL;
    if( 1U == ((STCM_TMRCS & STCM_TMRCS_TMR_RUNBP)>>1U)){
        tmr_state = STCM_TMR_ERR;
    }
    return tmr_state;
}

/*!
    \brief      get BIST error state (API_ID(0x0001BU))
    \param[in]  error_code: BIST error code
                only one parameter can be selected which is shown as below:
      \arg        BESTAT0_PLLULK: PLL unlock error code
      \arg        BESTAT0_LBWDG: LBIST watchdog error code
      \arg        BESTAT0_INVPTR: invalid LBIST pointer error code
      \arg        BESTAT0_BPSEL: BIST phase select error state flag
      \arg        BESTAT0_INVAITPADDR: invalid AIT packet address error code
      \arg        BESTAT0_MBWDGx(x=0~12): MBIST partition x watchdog error code
      \arg        BESTAT0_MBWDGEG: MBIST watchdog global error code
      \arg        BESTAT1_SP0: SMART protocol error code 0
      \arg        BESTAT1_SP1: SMART protocol error code 1
      \arg        BESTAT1_SP2: SMART protocol error code 2
      \arg        BESTAT1_AITP0: AIT protocol error code 0
      \arg        BESTAT1_AITP1: AIT protocol error code 1
      \arg        BESTAT1_RECOV: recoverable error code
      \arg        BESTAT1_UNRECOV: unrecoverable error code
    \param[out] none
    \retval     BIST error state
      \arg        RESET: BIST error is reset
      \arg        SET: BIST error is set
*/
FlagStatus stcm_bist_err_stat_get(stcm_error_code_enum error_code)
{
    FlagStatus bist_err_sate = RESET;
    switch(error_code){
        case BESTAT0_PLLULK:
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case BESTAT0_LBWDG:
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        case BESTAT0_INVPTR:
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case BESTAT0_BPSEL:
        case BESTAT0_INVAITPADDR:
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        case BESTAT0_MBWDG0:
        case BESTAT0_MBWDG1:
        case BESTAT0_MBWDG2:
        case BESTAT0_MBWDG3:
        case BESTAT0_MBWDG4:
        case BESTAT0_MBWDG5:
        case BESTAT0_MBWDG6:
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case BESTAT0_MBWDG7:
        case BESTAT0_MBWDG8:
        case BESTAT0_MBWDG9:
        case BESTAT0_MBWDG10:
        case BESTAT0_MBWDG11:
        case BESTAT0_MBWDG12:
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        case BESTAT0_MBWDGEG:
          if(1U == ((STCM_BESTAT0 >> ((uint32_t)error_code>>1U)) & 0x00000001U)){
            bist_err_sate = SET;
          }
        break;
        case BESTAT1_SP0:
        case BESTAT1_SP1:
        case BESTAT1_SP2:
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case BESTAT1_AITP0:
        case BESTAT1_AITP1:
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        case BESTAT1_RECOV:
        case BESTAT1_UNRECOV:
          if(1U == ((STCM_BESTAT1 >> ((uint32_t)error_code>>1U)) & 0x00000001U)){
            bist_err_sate = SET;
          }
        break;
        default:
#ifdef FW_DEBUG_ERR_REPORT
            fw_debug_report_err(STCM_MODULE_ID,API_ID(0x001BU),ERR_PARAM_INVALID);
#endif /* FW_DEBUG_ERR_REPORT */
        break;
    }
    return bist_err_sate;
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      get the timeout or failed LBIST AIT information (API_ID(0x0001CU))
    \param[in]  none
    \param[out] packet_addr: timeout or failed ait address
    \param[out] ait_stat: timeout or failed ait state
    \retval     none
*/
void stcm_failed_timeout_lbist_ait_info_get(uint16_t *packet_addr,uint8_t *ait_stat)
{
#ifdef FW_DEBUG_ERR_REPORT
    if((NOT_VALID_POINTER(packet_addr)) || (NOT_VALID_POINTER(ait_stat))) {
        fw_debug_report_err(STCM_MODULE_ID, API_ID(0x001CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        *packet_addr = (uint16_t)(STCM_LBPEINF & STCM_LBPEINF_LBPEADDR)>>16U;
        *ait_stat    = (uint8_t)(STCM_LBPEINF & STCM_LBPEINF_AIT_STAT);
    }
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
